/* Here you can provide nice strings to show up in the style preferences 
   You also need to localize the imported states and keywords
   they need to be prefixed with a /<modename>/ */

"Comment"       = "/* Comment */";
"SingleComment" = "// Comment";
"String"        = "\"Strings\"";

"/Javascript/Keywords" = "Javascript Keywords";
"/Javascript/Numbers" = "Javascript Numbers";
"/Javascript/Characters" = "Characters";
"/Javascript/FunctionRegex" = "Function Calls";
"/Javascript/AutodocComment" = "/*\" Comment \"*/";
"/Javascript/Comment" = "/* Comment */";
"/Javascript/SingleComment" = "// Comment";
"/Javascript/Regular Expressions" = "Regular Expressions";
"/Javascript/Escaped Characters" = "Escaped Characters";
"/Javascript/String" = "\"Strings\"";
"/Javascript/SingleString" = "'Strings'";

"/XML/Attributes in Tags" = "Attributes in Tags";
"/XML/Strings in Tags" = "\"Strings in Tags\"";
"/XML/Single Strings in Tags" = "'Strings in Tags'";

"/PHP-HTML/PHP Delimiter" = "<?php Delimiter>";
"/PHP-HTML/PHP4 Functions" = "PHP4 Functions";
"/PHP-HTML/PHP Keywords" = "PHP Keywords";
"/PHP-HTML/PHP Magic Constants" = "PHP Magic Constants";
"/PHP-HTML/PHP Magic Methods" = "PHP Magic Methods";
"/PHP-HTML/PHP Numbers" = "PHP Numbers";
"/PHP-HTML/FunctionRegex" = "Function Calls";
"/PHP-HTML/PHP Variables" = "$Variables";
"/PHP-HTML/Expanded Variables" = "$Variables";
"/PHP-HTML/Expanded Variables 2" = "{Variables}";
"/PHP-HTML/PHP Comment" = "/* Comment */";
"/PHP-HTML/PHP SingleComment" = "//Comment, #Comment";
"/PHP-HTML/PHP String" = "\"Strings\"";
"/PHP-HTML/PHP String2" = "'Strings'";
"/PHP-HTML/PHP Heredoc" = ">>>Heredoc";
"/PHP-HTML/PHP" = "PHP Code";

"ERB Delimiter" = "<%ERB Delimiter%>";
"/Ruby/Literals" = "Literals";
"/Ruby/Attribute Definitions" = "Attribute Definitions";
"/Ruby/Definitions" = "Definitions";
"/Ruby/Keywords" = "Keywords";
"/Ruby/Builtin Functions" = "Builtin Functions";
"/Ruby/Builtin Globals" = "Builtin Globals";
"/Ruby/Builtin Classes" = "Builtin Classes";
"/Ruby/Symbols" = ":symbols";
"/Ruby/Numbers" = "Numbers";
"/Ruby/Instance Variables" = "Instance Variables";
"/Ruby/Class Variables" = "Class Variables";
"/Ruby/Global Variables" = "Global Variables";
"/Ruby/String with double quotes" = "\"Strings\"";
"/Ruby/test" = "#{Embedded expressions}";
"/Ruby/String with single quotes" = "'Strings'";
"/Ruby/Backticks" = "`Backticks`";
"/Ruby/Singleline Comment" = "# Comment";
"/Ruby/Regexp" = "Regular expression";
"/Ruby/Escaped Characters" = "Escaped Characters";
"/Ruby/POD Comments" = "POD Comments";
"/Ruby/HTMLComment" = "<!-- comment -->";
"/Ruby/Heredoc" = ">>HEREDOC String";
"/Ruby/Hexadecimal Characters" = "Hexadecimal Characters";
"/Ruby/Embedded Expression" = "#{Embedded Expression}";
"/Ruby/Strings with percent Q1" = "%Q/Strings/";
"/Ruby/Strings with percent Q2" = "%Q{Strings}";
"/Ruby/Strings with percent Q3" = "%Q[Strings]";
"/Ruby/Strings with percent /" = "%/Strings/";
"/Ruby/Strings with parenthesis" = "%Q(Strings)";
